export default [
  {
    title: 'Skoda Octavia 1.4 AMT, 2018, 80 000 км',
    adsDate: '2021-03-28 18:17:41',
    description:
      'В такси не работала, пробег настоящий 100%, весь кузов в заводской краске. Эксплуатация с конца 2018 года. Была оформлена на организацию(не такси) и через два года я ее выкупил\n' +
      'В отличном состоянии, вложений никаких не требует, коробка не дергает, мотор масло не ест, была притертость справа на крыле, устранили полировкой\n' +
      'Посмотреть можно в Пушкино 17км от мкад',
    phone: '895846XXXXX',
    type: 'Продам',
    data: [Object],
    category: 'Транспорт',
    region: 'Московская область'
  },
  {
    title: 'Skoda Octavia 1.4 AMT, 2018, 80 000 км',
    adsDate: '2021-03-28 18:17:41',
    description:
      'В такси не работала, пробег настоящий 100%, весь кузов в заводской краске. Эксплуатация с конца 2018 года. Была оформлена на организацию(не такси) и через два года я ее выкупил\n' +
      'В отличном состоянии, вложений никаких не требует, коробка не дергает, мотор масло не ест, была притертость справа на крыле, устранили полировкой\n' +
      'Посмотреть можно в Пушкино 17км от мкад',
    phone: '895846XXXXX',
    type: 'Продам',
    data: [Object],
    category: 'Транспорт',
    region: 'Московская область'
  }
];
