import CatalogAdapter from '../../src/adapters/CatalogAdapter.mjs';
import { createScope } from '../../libs/usecases/index.mjs';

import { PrismaClient } from '@prisma/client';
const prisma = new PrismaClient();

const jsDataMock = {
  Catalog: {
    $: {
      created_at: "2022-09-02T12:55:05.172990+03:00"
    },
    Make: [
      {
        $: {
          id: "329322",
          name: "Москвич"
        },
        Model: [
          {
            $: {
              id: "329402",
              name: "2141"
            },
            Generation: [
              {
                $: {
                  id: "332014",
                  name: "I (1986—1998)"
                },
                Modification: [
                  {
                    $: {
                      id: "346897",
                      name: "1.8 MT (90 л.с.)"
                    },
                    YearFrom: [
                      {
                        _: "1986",
                        $: {
                          id: "331144"
                        }
                      }
                    ],
                    YearTo: [
                      {
                        _: "1998",
                        $: {
                          id: "331132",
                          special_id: "999999"
                        }
                      }
                    ],
                    Make: [
                      {
                        _: "Москвич",
                        $: {
                          id: "329322"
                        }
                      }
                    ],
                    Model: [
                      {
                        _: "2141",
                        $: {
                          id: "329402"
                        }
                      }
                    ],
                    Generation: [
                      {
                        _: "I (1986—1998)",
                        $: {
                          id: "332014"
                        }
                      }
                    ],
                    FuelType: [
                      {
                        _: "Бензин",
                        $: {
                          id: "331247"
                        }
                      }
                    ],
                    DriveType: [
                      {
                        _: "Передний",
                        $: {
                          id: "331251"
                        }
                      }
                    ],
                    Transmission: [
                      {
                        _: "Механика",
                        $: {
                          id: "331254"
                        }
                      }
                    ],
                    Modification: [
                      {
                        _: "1.8 MT (90 л.с.)",
                        $: {
                          id: "346897"
                        }
                      }
                    ],
                    Power: [
                      {
                        _: "90",
                        $: {
                          id: "331286"
                        }
                      }
                    ],
                    EngineSize: [
                      {
                        _: "1.8",
                        $: {
                          id: "331771"
                        }
                      }
                    ],
                    BodyType: [
                      {
                        _: "Хетчбэк",
                        $: {
                          id: "331240"
                        }
                      }
                    ],
                    Doors: [
                      {
                        _: "5",
                        $: {
                          id: "331245"
                        }
                      }
                    ],
                    Complectations: [
                      {
                        Complectation: [
                          {
                            $: {
                              id: "391892",
                              name: "Базовая"
                            }
                          }
                        ]
                      }
                    ]
                  },
                  {
                    $: {
                      id: "346070",
                      name: "1.8d MT (60 л.с.)"
                    },
                    YearFrom: [
                      {
                        _: "1986",
                        $: {
                          id: "331144"
                        }
                      }
                    ],
                    YearTo: [
                      {
                        _: "1998",
                        $: {
                          id: "331132",
                          special_id: "999999"
                        }
                      }
                    ],
                    Make: [
                      {
                        _: "Москвич",
                        $: {
                          id: "329322"
                        }
                      }
                    ],
                    Model: [
                      {
                        _: "2141",
                        $: {
                          id: "329402"
                        }
                      }
                    ],
                    Generation: [
                      {
                        _: "I (1986—1998)",
                        $: {
                          id: "332014"
                        }
                      }
                    ],
                    FuelType: [
                      {
                        _: "Дизель",
                        $: {
                          id: "331248"
                        }
                      }
                    ],
                    DriveType: [
                      {
                        _: "Передний",
                        $: {
                          id: "331251"
                        }
                      }
                    ],
                    Transmission: [
                      {
                        _: "Механика",
                        $: {
                          id: "331254"
                        }
                      }
                    ],
                    Modification: [
                      {
                        _: "1.8d MT (60 л.с.)",
                        $: {
                          id: "346070"
                        }
                      }
                    ],
                    Power: [
                      {
                        _: "60",
                        $: {
                          id: "331331"
                        }
                      }
                    ],
                    EngineSize: [
                      {
                        _: "1.8",
                        $: {
                          id: "331771"
                        }
                      }
                    ],
                    BodyType: [
                      {
                        _: "Хетчбэк",
                        $: {
                          id: "331240"
                        }
                      }
                    ],
                    Doors: [
                      {
                        _: "5",
                        $: {
                          id: "331245"
                        }
                      }
                    ],
                    Complectations: [
                      {
                        Complectation: [
                          {
                            $: {
                              id: "391893",
                              name: "Базовая"
                            }
                          }
                        ]
                      }
                    ]
                  },
                  {
                    $: {
                      id: "414906",
                      name: "2.0 MT (113 л.с.)"
                    },
                    YearFrom: [
                      {
                        _: "1986",
                        $: {
                          id: "331144"
                        }
                      }
                    ],
                    YearTo: [
                      {
                        _: "1998",
                        $: {
                          id: "331132",
                          special_id: "999999"
                        }
                      }
                    ],
                    Make: [
                      {
                        _: "Москвич",
                        $: {
                          id: "329322"
                        }
                      }
                    ],
                    Model: [
                      {
                        _: "2141",
                        $: {
                          id: "329402"
                        }
                      }
                    ],
                    Generation: [
                      {
                        _: "I (1986—1998)",
                        $: {
                          id: "332014"
                        }
                      }
                    ],
                    FuelType: [
                      {
                        _: "Бензин",
                        $: {
                          id: "331247"
                        }
                      }
                    ],
                    DriveType: [
                      {
                        _: "Передний",
                        $: {
                          id: "331251"
                        }
                      }
                    ],
                    Transmission: [
                      {
                        _: "Механика",
                        $: {
                          id: "331254"
                        }
                      }
                    ],
                    Modification: [
                      {
                        _: "2.0 MT (113 л.с.)",
                        $: {
                          id: "414906"
                        }
                      }
                    ],
                    Power: [
                      {
                        _: "113",
                        $: {
                          id: "331334"
                        }
                      }
                    ],
                    EngineSize: [
                      {
                        _: "2.0",
                        $: {
                          id: "331805"
                        }
                      }
                    ],
                    BodyType: [
                      {
                        _: "Хетчбэк",
                        $: {
                          id: "331240"
                        }
                      }
                    ],
                    Doors: [
                      {
                        _: "5",
                        $: {
                          id: "331245"
                        }
                      }
                    ],
                    Complectations: [
                      {
                        Complectation: [
                          {
                            $: {
                              id: "415632",
                              name: "Базовая"
                            }
                          }
                        ]
                      }
                    ]
                  },
                  {
                    $: {
                      id: "341661",
                      name: "1.5 MT (72 л.с.)"
                    },
                    YearFrom: [
                      {
                        _: "1986",
                        $: {
                          id: "331144"
                        }
                      }
                    ],
                    YearTo: [
                      {
                        _: "1998",
                        $: {
                          id: "331132",
                          special_id: "999999"
                        }
                      }
                    ],
                    Make: [
                      {
                        _: "Москвич",
                        $: {
                          id: "329322"
                        }
                      }
                    ],
                    Model: [
                      {
                        _: "2141",
                        $: {
                          id: "329402"
                        }
                      }
                    ],
                    Generation: [
                      {
                        _: "I (1986—1998)",
                        $: {
                          id: "332014"
                        }
                      }
                    ],
                    FuelType: [
                      {
                        _: "Бензин",
                        $: {
                          id: "331247"
                        }
                      }
                    ],
                    DriveType: [
                      {
                        _: "Передний",
                        $: {
                          id: "331251"
                        }
                      }
                    ],
                    Transmission: [
                      {
                        _: "Механика",
                        $: {
                          id: "331254"
                        }
                      }
                    ],
                    Modification: [
                      {
                        _: "1.5 MT (72 л.с.)",
                        $: {
                          id: "341661"
                        }
                      }
                    ],
                    Power: [
                      {
                        _: "72",
                        $: {
                          id: "331274"
                        }
                      }
                    ],
                    EngineSize: [
                      {
                        _: "1.5",
                        $: {
                          id: "331768"
                        }
                      }
                    ],
                    BodyType: [
                      {
                        _: "Хетчбэк",
                        $: {
                          id: "331240"
                        }
                      }
                    ],
                    Doors: [
                      {
                        _: "5",
                        $: {
                          id: "331245"
                        }
                      }
                    ],
                    Complectations: [
                      {
                        Complectation: [
                          {
                            $: {
                              id: "391889",
                              name: "Базовая"
                            }
                          }
                        ]
                      }
                    ]
                  },
                  {
                    $: {
                      id: "344289",
                      name: "1.6 MT (76 л.с.)"
                    },
                    YearFrom: [
                      {
                        _: "1986",
                        $: {
                          id: "331144"
                        }
                      }
                    ],
                    YearTo: [
                      {
                        _: "1998",
                        $: {
                          id: "331132",
                          special_id: "999999"
                        }
                      }
                    ],
                    Make: [
                      {
                        _: "Москвич",
                        $: {
                          id: "329322"
                        }
                      }
                    ],
                    Model: [
                      {
                        _: "2141",
                        $: {
                          id: "329402"
                        }
                      }
                    ],
                    Generation: [
                      {
                        _: "I (1986—1998)",
                        $: {
                          id: "332014"
                        }
                      }
                    ],
                    FuelType: [
                      {
                        _: "Бензин",
                        $: {
                          id: "331247"
                        }
                      }
                    ],
                    DriveType: [
                      {
                        _: "Передний",
                        $: {
                          id: "331251"
                        }
                      }
                    ],
                    Transmission: [
                      {
                        _: "Механика",
                        $: {
                          id: "331254"
                        }
                      }
                    ],
                    Modification: [
                      {
                        _: "1.6 MT (76 л.с.)",
                        $: {
                          id: "344289"
                        }
                      }
                    ],
                    Power: [
                      {
                        _: "76",
                        $: {
                          id: "331291"
                        }
                      }
                    ],
                    EngineSize: [
                      {
                        _: "1.6",
                        $: {
                          id: "331769"
                        }
                      }
                    ],
                    BodyType: [
                      {
                        _: "Хетчбэк",
                        $: {
                          id: "331240"
                        }
                      }
                    ],
                    Doors: [
                      {
                        _: "5",
                        $: {
                          id: "331245"
                        }
                      }
                    ],
                    Complectations: [
                      {
                        Complectation: [
                          {
                            $: {
                              id: "391890",
                              name: "Базовая"
                            }
                          }
                        ]
                      }
                    ]
                  },
                  {
                    $: {
                      id: "345123",
                      name: "1.7 MT (85 л.с.)"
                    },
                    YearFrom: [
                      {
                        _: "1986",
                        $: {
                          id: "331144"
                        }
                      }
                    ],
                    YearTo: [
                      {
                        _: "1998",
                        $: {
                          id: "331132",
                          special_id: "999999"
                        }
                      }
                    ],
                    Make: [
                      {
                        _: "Москвич",
                        $: {
                          id: "329322"
                        }
                      }
                    ],
                    Model: [
                      {
                        _: "2141",
                        $: {
                          id: "329402"
                        }
                      }
                    ],
                    Generation: [
                      {
                        _: "I (1986—1998)",
                        $: {
                          id: "332014"
                        }
                      }
                    ],
                    FuelType: [
                      {
                        _: "Бензин",
                        $: {
                          id: "331247"
                        }
                      }
                    ],
                    DriveType: [
                      {
                        _: "Передний",
                        $: {
                          id: "331251"
                        }
                      }
                    ],
                    Transmission: [
                      {
                        _: "Механика",
                        $: {
                          id: "331254"
                        }
                      }
                    ],
                    Modification: [
                      {
                        _: "1.7 MT (85 л.с.)",
                        $: {
                          id: "345123"
                        }
                      }
                    ],
                    Power: [
                      {
                        _: "85",
                        $: {
                          id: "331296"
                        }
                      }
                    ],
                    EngineSize: [
                      {
                        _: "1.7",
                        $: {
                          id: "331770"
                        }
                      }
                    ],
                    BodyType: [
                      {
                        _: "Хетчбэк",
                        $: {
                          id: "331240"
                        }
                      }
                    ],
                    Doors: [
                      {
                        _: "5",
                        $: {
                          id: "331245"
                        }
                      }
                    ],
                    Complectations: [
                      {
                        Complectation: [
                          {
                            $: {
                              id: "391891",
                              name: "Базовая"
                            }
                          }
                        ]
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            $: {
              id: "331111",
              name: "Юрий Долгорукий"
            },
            Generation: [
              {
                $: {
                  id: "332032",
                  name: "I (1997—2001)"
                },
                Modification: [
                  {
                    $: {
                      id: "346783",
                      name: "1.8 MT (77 л.с.)"
                    },
                    YearFrom: [
                      {
                        _: "1997",
                        $: {
                          id: "331133"
                        }
                      }
                    ],
                    YearTo: [
                      {
                        _: "2001",
                        $: {
                          id: "331129",
                          special_id: "999999"
                        }
                      }
                    ],
                    Make: [
                      {
                        _: "Москвич",
                        $: {
                          id: "329322"
                        }
                      }
                    ],
                    Model: [
                      {
                        _: "Юрий Долгорукий",
                        $: {
                          id: "331111"
                        }
                      }
                    ],
                    Generation: [
                      {
                        _: "I (1997—2001)",
                        $: {
                          id: "332032"
                        }
                      }
                    ],
                    FuelType: [
                      {
                        _: "Бензин",
                        $: {
                          id: "331247"
                        }
                      }
                    ],
                    DriveType: [
                      {
                        _: "Передний",
                        $: {
                          id: "331251"
                        }
                      }
                    ],
                    Transmission: [
                      {
                        _: "Механика",
                        $: {
                          id: "331254"
                        }
                      }
                    ],
                    Modification: [
                      {
                        _: "1.8 MT (77 л.с.)",
                        $: {
                          id: "346783"
                        }
                      }
                    ],
                    Power: [
                      {
                        _: "77",
                        $: {
                          id: "331290"
                        }
                      }
                    ],
                    EngineSize: [
                      {
                        _: "1.8",
                        $: {
                          id: "331771"
                        }
                      }
                    ],
                    BodyType: [
                      {
                        _: "Хетчбэк",
                        $: {
                          id: "331240"
                        }
                      }
                    ],
                    Doors: [
                      {
                        _: "5",
                        $: {
                          id: "331245"
                        }
                      }
                    ],
                    Complectations: [
                      {
                        Complectation: [
                          {
                            $: {
                              id: "391927",
                              name: "Базовая"
                            }
                          }
                        ]
                      }
                    ]
                  },
                  {
                    $: {
                      id: "346895",
                      name: "1.8 MT (90 л.с.)"
                    },
                    YearFrom: [
                      {
                        _: "1997",
                        $: {
                          id: "331133"
                        }
                      }
                    ],
                    YearTo: [
                      {
                        _: "2001",
                        $: {
                          id: "331129",
                          special_id: "999999"
                        }
                      }
                    ],
                    Make: [
                      {
                        _: "Москвич",
                        $: {
                          id: "329322"
                        }
                      }
                    ],
                    Model: [
                      {
                        _: "Юрий Долгорукий",
                        $: {
                          id: "331111"
                        }
                      }
                    ],
                    Generation: [
                      {
                        _: "I (1997—2001)",
                        $: {
                          id: "332032"
                        }
                      }
                    ],
                    FuelType: [
                      {
                        _: "Бензин",
                        $: {
                          id: "331247"
                        }
                      }
                    ],
                    DriveType: [
                      {
                        _: "Передний",
                        $: {
                          id: "331251"
                        }
                      }
                    ],
                    Transmission: [
                      {
                        _: "Механика",
                        $: {
                          id: "331254"
                        }
                      }
                    ],
                    Modification: [
                      {
                        _: "1.8 MT (90 л.с.)",
                        $: {
                          id: "346895"
                        }
                      }
                    ],
                    Power: [
                      {
                        _: "90",
                        $: {
                          id: "331286"
                        }
                      }
                    ],
                    EngineSize: [
                      {
                        _: "1.8",
                        $: {
                          id: "331771"
                        }
                      }
                    ],
                    BodyType: [
                      {
                        _: "Хетчбэк",
                        $: {
                          id: "331240"
                        }
                      }
                    ],
                    Doors: [
                      {
                        _: "5",
                        $: {
                          id: "331245"
                        }
                      }
                    ],
                    Complectations: [
                      {
                        Complectation: [
                          {
                            $: {
                              id: "391928",
                              name: "Базовая"
                            }
                          }
                        ]
                      }
                    ]
                  },
                  {
                    $: {
                      id: "351131",
                      name: "2.0 MT (100 л.с.)"
                    },
                    YearFrom: [
                      {
                        _: "1997",
                        $: {
                          id: "331133"
                        }
                      }
                    ],
                    YearTo: [
                      {
                        _: "2001",
                        $: {
                          id: "331129",
                          special_id: "999999"
                        }
                      }
                    ],
                    Make: [
                      {
                        _: "Москвич",
                        $: {
                          id: "329322"
                        }
                      }
                    ],
                    Model: [
                      {
                        _: "Юрий Долгорукий",
                        $: {
                          id: "331111"
                        }
                      }
                    ],
                    Generation: [
                      {
                        _: "I (1997—2001)",
                        $: {
                          id: "332032"
                        }
                      }
                    ],
                    FuelType: [
                      {
                        _: "Бензин",
                        $: {
                          id: "331247"
                        }
                      }
                    ],
                    DriveType: [
                      {
                        _: "Передний",
                        $: {
                          id: "331251"
                        }
                      }
                    ],
                    Transmission: [
                      {
                        _: "Механика",
                        $: {
                          id: "331254"
                        }
                      }
                    ],
                    Modification: [
                      {
                        _: "2.0 MT (100 л.с.)",
                        $: {
                          id: "351131"
                        }
                      }
                    ],
                    Power: [
                      {
                        _: "100",
                        $: {
                          id: "331299"
                        }
                      }
                    ],
                    EngineSize: [
                      {
                        _: "2.0",
                        $: {
                          id: "331805"
                        }
                      }
                    ],
                    BodyType: [
                      {
                        _: "Хетчбэк",
                        $: {
                          id: "331240"
                        }
                      }
                    ],
                    Doors: [
                      {
                        _: "5",
                        $: {
                          id: "331245"
                        }
                      }
                    ],
                    Complectations: [
                      {
                        Complectation: [
                          {
                            $: {
                              id: "391931",
                              name: "Базовая"
                            }
                          }
                        ]
                      }
                    ]
                  },
                  {
                    $: {
                      id: "351275",
                      name: "2.0 MT (113 л.с.)"
                    },
                    YearFrom: [
                      {
                        _: "1997",
                        $: {
                          id: "331133"
                        }
                      }
                    ],
                    YearTo: [
                      {
                        _: "2001",
                        $: {
                          id: "331129",
                          special_id: "999999"
                        }
                      }
                    ],
                    Make: [
                      {
                        _: "Москвич",
                        $: {
                          id: "329322"
                        }
                      }
                    ],
                    Model: [
                      {
                        _: "Юрий Долгорукий",
                        $: {
                          id: "331111"
                        }
                      }
                    ],
                    Generation: [
                      {
                        _: "I (1997—2001)",
                        $: {
                          id: "332032"
                        }
                      }
                    ],
                    FuelType: [
                      {
                        _: "Бензин",
                        $: {
                          id: "331247"
                        }
                      }
                    ],
                    DriveType: [
                      {
                        _: "Передний",
                        $: {
                          id: "331251"
                        }
                      }
                    ],
                    Transmission: [
                      {
                        _: "Механика",
                        $: {
                          id: "331254"
                        }
                      }
                    ],
                    Modification: [
                      {
                        _: "2.0 MT (113 л.с.)",
                        $: {
                          id: "351275"
                        }
                      }
                    ],
                    Power: [
                      {
                        _: "113",
                        $: {
                          id: "331334"
                        }
                      }
                    ],
                    EngineSize: [
                      {
                        _: "2.0",
                        $: {
                          id: "331805"
                        }
                      }
                    ],
                    BodyType: [
                      {
                        _: "Хетчбэк",
                        $: {
                          id: "331240"
                        }
                      }
                    ],
                    Doors: [
                      {
                        _: "5",
                        $: {
                          id: "331245"
                        }
                      }
                    ],
                    Complectations: [
                      {
                        Complectation: [
                          {
                            $: {
                              id: "391929",
                              name: "Базовая"
                            }
                          }
                        ]
                      }
                    ]
                  },
                  {
                    $: {
                      id: "352658",
                      name: "2.0 MT (99 л.с.)"
                    },
                    YearFrom: [
                      {
                        _: "1997",
                        $: {
                          id: "331133"
                        }
                      }
                    ],
                    YearTo: [
                      {
                        _: "2001",
                        $: {
                          id: "331129",
                          special_id: "999999"
                        }
                      }
                    ],
                    Make: [
                      {
                        _: "Москвич",
                        $: {
                          id: "329322"
                        }
                      }
                    ],
                    Model: [
                      {
                        _: "Юрий Долгорукий",
                        $: {
                          id: "331111"
                        }
                      }
                    ],
                    Generation: [
                      {
                        _: "I (1997—2001)",
                        $: {
                          id: "332032"
                        }
                      }
                    ],
                    FuelType: [
                      {
                        _: "Бензин",
                        $: {
                          id: "331247"
                        }
                      }
                    ],
                    DriveType: [
                      {
                        _: "Передний",
                        $: {
                          id: "331251"
                        }
                      }
                    ],
                    Transmission: [
                      {
                        _: "Механика",
                        $: {
                          id: "331254"
                        }
                      }
                    ],
                    Modification: [
                      {
                        _: "2.0 MT (99 л.с.)",
                        $: {
                          id: "352658"
                        }
                      }
                    ],
                    Power: [
                      {
                        _: "99",
                        $: {
                          id: "331329"
                        }
                      }
                    ],
                    EngineSize: [
                      {
                        _: "2.0",
                        $: {
                          id: "331805"
                        }
                      }
                    ],
                    BodyType: [
                      {
                        _: "Хетчбэк",
                        $: {
                          id: "331240"
                        }
                      }
                    ],
                    Doors: [
                      {
                        _: "5",
                        $: {
                          id: "331245"
                        }
                      }
                    ],
                    Complectations: [
                      {
                        Complectation: [
                          {
                            $: {
                              id: "391930",
                              name: "Базовая"
                            }
                          }
                        ]
                      }
                    ]
                  },
                  {
                    $: {
                      id: "345117",
                      name: "1.7 MT (85 л.с.)"
                    },
                    YearFrom: [
                      {
                        _: "1997",
                        $: {
                          id: "331133"
                        }
                      }
                    ],
                    YearTo: [
                      {
                        _: "2001",
                        $: {
                          id: "331129",
                          special_id: "999999"
                        }
                      }
                    ],
                    Make: [
                      {
                        _: "Москвич",
                        $: {
                          id: "329322"
                        }
                      }
                    ],
                    Model: [
                      {
                        _: "Юрий Долгорукий",
                        $: {
                          id: "331111"
                        }
                      }
                    ],
                    Generation: [
                      {
                        _: "I (1997—2001)",
                        $: {
                          id: "332032"
                        }
                      }
                    ],
                    FuelType: [
                      {
                        _: "Бензин",
                        $: {
                          id: "331247"
                        }
                      }
                    ],
                    DriveType: [
                      {
                        _: "Передний",
                        $: {
                          id: "331251"
                        }
                      }
                    ],
                    Transmission: [
                      {
                        _: "Механика",
                        $: {
                          id: "331254"
                        }
                      }
                    ],
                    Modification: [
                      {
                        _: "1.7 MT (85 л.с.)",
                        $: {
                          id: "345117"
                        }
                      }
                    ],
                    Power: [
                      {
                        _: "85",
                        $: {
                          id: "331296"
                        }
                      }
                    ],
                    EngineSize: [
                      {
                        _: "1.7",
                        $: {
                          id: "331770"
                        }
                      }
                    ],
                    BodyType: [
                      {
                        _: "Хетчбэк",
                        $: {
                          id: "331240"
                        }
                      }
                    ],
                    Doors: [
                      {
                        _: "5",
                        $: {
                          id: "331245"
                        }
                      }
                    ],
                    Complectations: [
                      {
                        Complectation: [
                          {
                            $: {
                              id: "391926",
                              name: "Базовая"
                            }
                          }
                        ]
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            $: {
              id: "329483",
              name: "410"
            },
            Generation: [
              {
                $: {
                  id: "332021",
                  name: "I (1957—1961)"
                },
                Modification: [
                  {
                    $: {
                      id: "337865",
                      name: "1.2 4WD MT (35 л.с.)"
                    },
                    YearFrom: [
                      {
                        _: "1957",
                        $: {
                          id: "331173"
                        }
                      }
                    ],
                    YearTo: [
                      {
                        _: "1961",
                        $: {
                          id: "331169",
                          special_id: "999999"
                        }
                      }
                    ],
                    Make: [
                      {
                        _: "Москвич",
                        $: {
                          id: "329322"
                        }
                      }
                    ],
                    Model: [
                      {
                        _: "410",
                        $: {
                          id: "329483"
                        }
                      }
                    ],
                    Generation: [
                      {
                        _: "I (1957—1961)",
                        $: {
                          id: "332021"
                        }
                      }
                    ],
                    FuelType: [
                      {
                        _: "Бензин",
                        $: {
                          id: "331247"
                        }
                      }
                    ],
                    DriveType: [
                      {
                        _: "Полный",
                        $: {
                          id: "331253"
                        }
                      }
                    ],
                    Transmission: [
                      {
                        _: "Механика",
                        $: {
                          id: "331254"
                        }
                      }
                    ],
                    Modification: [
                      {
                        _: "1.2 4WD MT (35 л.с.)",
                        $: {
                          id: "337865"
                        }
                      }
                    ],
                    Power: [
                      {
                        _: "35",
                        $: {
                          id: "331259"
                        }
                      }
                    ],
                    EngineSize: [
                      {
                        _: "1.2",
                        $: {
                          id: "331766"
                        }
                      }
                    ],
                    BodyType: [
                      {
                        _: "Седан",
                        $: {
                          id: "331237"
                        }
                      }
                    ],
                    Doors: [
                      {
                        _: "4",
                        $: {
                          id: "331244"
                        }
                      }
                    ],
                    Complectations: [
                      {
                        Complectation: [
                          {
                            $: {
                              id: "391901",
                              name: "Базовая"
                            }
                          }
                        ]
                      }
                    ]
                  },
                  {
                    $: {
                      id: "339333",
                      name: "1.4 4WD MT (45 л.с.)"
                    },
                    YearFrom: [
                      {
                        _: "1957",
                        $: {
                          id: "331173"
                        }
                      }
                    ],
                    YearTo: [
                      {
                        _: "1961",
                        $: {
                          id: "331169",
                          special_id: "999999"
                        }
                      }
                    ],
                    Make: [
                      {
                        _: "Москвич",
                        $: {
                          id: "329322"
                        }
                      }
                    ],
                    Model: [
                      {
                        _: "410",
                        $: {
                          id: "329483"
                        }
                      }
                    ],
                    Generation: [
                      {
                        _: "I (1957—1961)",
                        $: {
                          id: "332021"
                        }
                      }
                    ],
                    FuelType: [
                      {
                        _: "Бензин",
                        $: {
                          id: "331247"
                        }
                      }
                    ],
                    DriveType: [
                      {
                        _: "Полный",
                        $: {
                          id: "331253"
                        }
                      }
                    ],
                    Transmission: [
                      {
                        _: "Механика",
                        $: {
                          id: "331254"
                        }
                      }
                    ],
                    Modification: [
                      {
                        _: "1.4 4WD MT (45 л.с.)",
                        $: {
                          id: "339333"
                        }
                      }
                    ],
                    Power: [
                      {
                        _: "45",
                        $: {
                          id: "331333"
                        }
                      }
                    ],
                    EngineSize: [
                      {
                        _: "1.4",
                        $: {
                          id: "331774"
                        }
                      }
                    ],
                    BodyType: [
                      {
                        _: "Седан",
                        $: {
                          id: "331237"
                        }
                      }
                    ],
                    Doors: [
                      {
                        _: "4",
                        $: {
                          id: "331244"
                        }
                      }
                    ],
                    Complectations: [
                      {
                        Complectation: [
                          {
                            $: {
                              id: "391900",
                              name: "Базовая"
                            }
                          }
                        ]
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}

afterAll(async () => {
  await prisma.$disconnect();
});

test('get catalog', async () => {
  const scope = await createScope({}, false);
  const adapter = new CatalogAdapter(scope.cradle);
  const registry = await adapter.convert();
  expect(registry).toStrictEqual(jsDataMock);
});
